// ignore_for_file: camel_case_types, non_constant_identifier_names

import 'package:wiki_cross/crossgen.dart';

class test_words_set {
  static List <Gen_Word> words = [
    Gen_Word(word: 'Пельмени', weight: 0, definition: 'традиционное блюдо русской кухни в виде термически обработанных изделий из пресного теста с начинкой из рубленого мяса или рыбы, ведущее своё происхождение с Урала и Сибири.'),
    Gen_Word(word: 'Сан-Мигель', weight: 0, definition: 'река в США, в штате Колорадо, приток реки Долорес.'),
    Gen_Word(word: 'Родник', weight: 0, definition: 'естественный выход подземных вод на земную поверхность на суше или под водой (подводный источник).'),
    Gen_Word(word: 'Суперспринт', weight: 0, definition: 'вид биатлонной гонки, которая состоит из двух самостоятельных стартов проводящихся за один день: «___________ — квалификация» и «___________ — финал».'),
    Gen_Word(word: 'Костные', weight: 0, definition: 'группа рыб, включающая всех костных позвоночных, за исключением четвероногих. Костные рыбы имеют парные плавники[1].'),
    Gen_Word(word: 'ПМД-6', weight: 0, definition: 'советская противопехотная мина нажимного действия. Была принятна на вооружение в конце 1930-х годов. '),
    Gen_Word(word: 'Финес', weight: 0, definition: '_____ Флинн - главный персонаж мультсериала Уолта Диснея «Финес и Ферб».'),
    Gen_Word(word: 'Цветница', weight: 0, definition: 'село в Болгарии.'),
    Gen_Word(word: 'Инбридинг', weight: 0, definition: 'форма гомогамии, скрещивание близкородственных форм в пределах одной популяции организмов (животных или растений).'),
    Gen_Word(word: 'Домашние', weight: 0, definition: 'животные, которые были одомашнены человеком разумным и которых он содержит, предоставляя им кров и пищу.'),
    Gen_Word(word: 'Золотой', weight: 0, definition: '__________ лев — главная награда Венецианского кинофестиваля.'),
    Gen_Word(word: 'Magnet-ссылка', weight: 0, definition: 'открытый, находящийся в стадии рабочего черновика стандарт, определяющий URI-схему т. н. ______-ссылок, предназначенных преимущественно для указания на ресурсы, доступные к загрузке через пиринговые сети.'),
    Gen_Word(word: 'Наследование', weight: 0, definition: 'концепция объектно-ориентированного программирования, согласно которой абстрактный тип данных может наследовать данные и функциональность некоторого существующего типа, способствуя повторному использованию компонентов программного обеспечения.'),
    Gen_Word(word: 'Санкт-Петербург', weight: 0, definition: 'второй по численности населения город России.'),
    Gen_Word(word: 'Москва', weight: 0, definition: 'столица России, город федерального значения, административный центр Центрального федерального округа и центр Московской области, в состав которой не входит.'),
    Gen_Word(word: 'Город', weight: 0, definition: 'крупный населённый пункт, жители которого заняты, как правило, не сельским хозяйством.'),
    Gen_Word(word: 'Солнце', weight: 0, definition: 'одна из звёзд нашей Галактики (Млечный Путь) и единственная звезда Солнечной системы.'),
    Gen_Word(word: 'Звезда', weight: 0, definition: 'массивное самосветящееся небесное тело, состоящее из газа или плазмы, в котором происходят, происходили или будут происходить термоядерные реакции.'),
    Gen_Word(word: 'Созвездия', weight: 0, definition: 'в современной астрономии участки, на которые разделена небесная сфера для удобства ориентирования на звёздном небе.'),
    Gen_Word(word: 'Поезд', weight: 0, definition: 'в современном понятии — сформированный и сцеплённый состав, состоящий из группы вагонов, с одним или несколькими действующими локомотивами или моторными вагонами, приводящими его в движение, и имеющий установленные сигналы (звуковые и видимые), которые обозначают его голову и хвост.'),
    Gen_Word(word: 'Окружение', weight: 0, definition: 'военный стратегический (тактический) приём, заключающийся в изоляции определённой группировки войск (сил) противника от остальных сил и их союзников в целях уничтожения или пленения.'),
    Gen_Word(word: 'Песок', weight: 0, definition: 'рыхлая мелкообломочная осадочная горная порода (или осадок), а также искусственный строительный и декоративный материал.'),
    Gen_Word(word: 'Flutter', weight: 0, definition: 'комплект средств разработки и фреймворк с открытым исходным кодом для создания мобильных приложений под Android и iOS, веб-приложений, и нативных приложений под Windows, Apple и Linux с использованием языка программирования Dart, разработанный и развиваемый корпорацией Google.'),
    Gen_Word(word: 'Google', weight: 0, definition: 'американская транснациональная корпорация в составе холдинга Alphabet, инвестирующая в интернет-поиск, облачные вычисления и рекламные технологии.'),
    Gen_Word(word: 'Dart', weight: 0, definition: 'язык программирования, созданный Google.'),
    Gen_Word(word: 'Android', weight: 0, definition: 'операционная система для смартфонов, планшетов, электронных книг, цифровых проигрывателей, наручных часов, фитнес-браслетов, игровых приставок, ноутбуков, нетбуков, смартбуков, очков Google Glass[3], телевизоров[4], проекторов и других устройств (в 2015 году появилась поддержка автомобильных развлекательных систем[5] и бытовых роботов).'),
    Gen_Word(word: 'Java', weight: 0, definition: 'строго типизированный объектно-ориентированный язык программирования общего назначения, разработанный компанией Sun Microsystems (в последующем приобретённой компанией Oracle).'),
  ];

  static List <Gen_Word> Get()
  {
    return words;
  }
}