Repository: SmirnuX/wiki-cross
Catalog: lib/l10n/app_*.arb
Languages: ru

source: Hello World!
ru: Привет мир!

# navError
source: Navigator error - couldn't find default route.
ru: Ошибка навигации - не удалось найти маршрут по умолчанию.

# downloadingDefinitions
source: Getting definitions...
ru: Получение определений...

source: Getting links...
ru: Получение ссылок...

source: Hints left:
ru: Подсказок осталось:

# searchNoResults
source: Nothing found.
ru: По запросу ничего не найдено

# searchEnterQuery
source: Enter title of Wikipedia article
ru: Введите наименование искомой статьи в Википедии

source: Search error:
ru: Ошибка поиска:

source: Chosen theme
ru: Выбранная тема

source: Size
ru: Размер

source: Difficulty
ru: Сложность

# diffLow
source: Low
ru: Низкий

# diffMedium
source: Medium
ru: Средний

# diffHard
source: Hard
ru: Высокий

source: Error
ru: Ошибка

# errorUnknown
source: Unknown error
ru: Неизвестная ошибка

# crossSolved
source: Crossword solved
ru: Кроссворд решен

# crossNotSolved
source: Crossword not solved
ru: Кроссворд не решен

source: Hints used:
ru: Подсказок использовано:

source: Right words:
ru: Правильные слова:

source: Show wrong words
ru: Показать неправильные слова
